In [1]:
import pandas as pd
import numpy as np

In [2]:
date=pd.read_csv('orders.csv')
time=pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [8]:
# converting to datetime object
date['date']=pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [14]:
date.drop(columns=['product_id','city_id','orders'],axis=1,inplace=True)
date.head()

        date
0 2019-12-10
1 2018-08-15
2 2018-10-23
3 2019-08-17
4 2019-01-06

In [22]:
# Extract year
date['date_year']=date['date'].dt.year
#extract month
date['date_month']=date['date'].dt.month
date['date_month_name']=date['date'].dt.month_name()
#extract days
date['date_days']=date['date'].dt.day
date['date_days_name']=date['date'].dt.day_name()
# Extract day of week
date['DATE_dow']=date['date'].dt.dayofweek
# Extract week of the year
date['date_week']=date['date'].dt.isocalendar().week
# Extract quarter
date['date_quarter']=date['date'].dt.quarter

date.sample(5)

,date,date_year,date_month,date_month_name,date_days,date_days_name,DATE_dow,date_week,date_quarter
40,2019-11-27,2019,11,November,27,Wednesday,2,48,4
895,2018-10-31,2018,10,October,31,Wednesday,2,44,4
287,2018-12-15,2018,12,December,15,Saturday,5,50,4
940,2019-03-02,2019,3,March,2,Saturday,5,9,1
207,2019-04-01,2019,4,April,1,Monday,0,14,2

In [27]:
# IS WEEKEND
date['Is_weekend']=np.where(date['DATE_dow'].isin([5,6]),'yes','no')
date.head()

,date,date_year,date_month,date_month_name,date_days,date_days_name,DATE_dow,date_week,date_quarter,Is_weekend
0,2019-12-10,2019,12,December,10,Tuesday,1,50,4,no
1,2018-08-15,2018,8,August,15,Wednesday,2,33,3,no
2,2018-10-23,2018,10,October,23,Tuesday,1,43,4,no
3,2019-08-17,2019,8,August,17,Saturday,5,33,3,yes
4,2019-01-06,2019,1,January,6,Sunday,6,1,1,yes

In [29]:
# Extract time elapsed
import datetime
today=datetime.datetime.today()
today

datetime.datetime(2025, 4, 9, 8, 32, 39, 562832)

In [36]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [38]:
time['date']=pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [39]:
today-date['date']

0     1947 days 08:32:39.562832
1     2429 days 08:32:39.562832
2     2360 days 08:32:39.562832
3     2062 days 08:32:39.562832
4     2285 days 08:32:39.562832
                 ...
995   2375 days 08:32:39.562832
996   2316 days 08:32:39.562832
997   2164 days 08:32:39.562832
998   2229 days 08:32:39.562832
999   2003 days 08:32:39.562832
Name: date, Length: 1000, dtype: timedelta64[ns]

In [40]:
(today-date['date']).dt.days

0      1947
1      2429
2      2360
3      2062
4      2285
       ...
995    2375
996    2316
997    2164
998    2229
999    2003
Name: date, Length: 1000, dtype: int64

In [50]:
# Calculate months passed (approximate, using 30-day months)
time['months_passed'] = np.round((today - date['date']) / pd.to_timedelta(30, unit='D'))

In [54]:
time['time'] = time['date'].dt.time
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,months_passed,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,65.0,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,81.0,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,79.0,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,69.0,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,76.0,23,11,0,23:11:00

In [53]:
today - time['date']

0     4133 days 07:42:39.562832
1     3997 days 08:52:39.562832
2     4483 days 08:11:39.562832
3     3785 days 08:01:39.562832
4     4182 days 09:21:39.562832
                 ...
995   4772 days 07:42:39.562832
996   4093 days 09:18:39.562832
997   4558 days 08:55:39.562832
998   4674 days 08:58:39.562832
999   3946 days 09:07:39.562832
Name: date, Length: 1000, dtype: timedelta64[ns]

In [59]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.571190e+08
1      3.453728e+08
2      3.873607e+08
3      3.270529e+08
4      3.613585e+08
           ...
995    4.123286e+08
996    3.536687e+08
997    3.938433e+08
998    4.038659e+08
999    3.409673e+08
Name: date, Length: 1000, dtype: float64

In [60]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.951983e+06
1      5.756213e+06
2      6.456012e+06
3      5.450882e+06
4      6.022642e+06
           ...
995    6.872143e+06
996    5.894479e+06
997    6.564056e+06
998    6.731099e+06
999    5.682788e+06
Name: date, Length: 1000, dtype: float64

In [61]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       99199.710990
1       95936.877656
2      107600.194323
3       90848.027656
4      100377.360990
           ...
995    114535.710990
996     98241.310990
997    109400.927656
998    112184.977656
999     94713.127656
Name: date, Length: 1000, dtype: float64